Autodesk.Revit.DB.Geolocation.Services.AdvancedGeolocationData.ForceUnityScaleOption
If true, force the scale option to unity, regardless of other settings.
This should only be used during the upgrade workflow,
where we do not have any other meaningful settings besides the baseCRS.

Autodesk.Revit.DB.Geolocation.Services.AdvancedGeolocationData
Collection of data to create an AdvancedGeolocation